# Koby Hass
## Week 12
### Python Panda Series

In [3]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [4]:
s = Series([2,5,7,-9,8,4])
s

0    2
1    5
2    7
3   -9
4    8
5    4
dtype: int64

In [5]:
s.values

array([ 2,  5,  7, -9,  8,  4], dtype=int64)

In [6]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [7]:
summer_olympic = Series([2520,1122,938,847,713], index = ['USA', 'Russia', 'China', 'UK', 'France'])

In [8]:
summer_olympic

USA       2520
Russia    1122
China      938
UK         847
France     713
dtype: int64

In [10]:
summer_olympic('China')

TypeError: 'Series' object is not callable

In [11]:
'USA' in summer_olympic

True

In [13]:
summer_olympic_dict = summer_olympic.to_dict()

summer_olympic_dict

{'USA': 2520, 'Russia': 1122, 'China': 938, 'UK': 847, 'France': 713}

In [17]:
summer_olympic_Series = Series(summer_olympic_dict)

summer_olympic_Series

USA       2520
Russia    1122
China      938
UK         847
France     713
dtype: int64

In [18]:
countries = ['Russia', 'France', 'Germany', 'USA', 'UK', 'Italy']

In [19]:
s2 = Series(summer_olympic_dict, index = countries)

s2

Russia     1122.0
France      713.0
Germany       NaN
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [21]:
s2.index.name

In [22]:
s2

Russia     1122.0
France      713.0
Germany       NaN
USA        2520.0
UK          847.0
Italy         NaN
dtype: float64

In [30]:
data_dict = {'States': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
            'Year': [2000,2001,2002,2001,2002,2003],
            'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}

df = pd.DataFrame(data_dict)

df

   States  Year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [31]:
df.head()

   States  Year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [33]:
df.tail()

   States  Year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
pd.DataFrame(data_dict, columns=['Year','State','pop'])

   Year State  pop
0  2000   NaN  1.5
1  2001   NaN  1.7
2  2002   NaN  3.6
3  2001   NaN  2.4
4  2002   NaN  2.9
5  2003   NaN  3.2

In [36]:
df2= pd.DataFrame(data_dict, columns=['Year','State','pop', 'debt'],
                 index = ['one', 'two', 'three', 'four', 'five','six'])

df2

       Year State  pop debt
one    2000   NaN  1.5  NaN
two    2001   NaN  1.7  NaN
three  2002   NaN  3.6  NaN
four   2001   NaN  2.4  NaN
five   2002   NaN  2.9  NaN
six    2003   NaN  3.2  NaN

In [38]:
df2['State']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: State, dtype: object

In [39]:
df2.columns

Index(['Year', 'State', 'pop', 'debt'], dtype='object')

In [40]:
df2.Year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: Year, dtype: int64

In [41]:
df2.loc['three']

Year     2002
State     NaN
pop       3.6
debt      NaN
Name: three, dtype: object

In [42]:
df2['debt'] = 10.5

In [43]:
df2

       Year State  pop  debt
one    2000   NaN  1.5  10.5
two    2001   NaN  1.7  10.5
three  2002   NaN  3.6  10.5
four   2001   NaN  2.4  10.5
five   2002   NaN  2.9  10.5
six    2003   NaN  3.2  10.5

In [44]:
df2['debt'] = np.arange(6.)

df2

       Year State  pop  debt
one    2000   NaN  1.5   0.0
two    2001   NaN  1.7   1.0
three  2002   NaN  3.6   2.0
four   2001   NaN  2.4   3.0
five   2002   NaN  2.9   4.0
six    2003   NaN  3.2   5.0

In [45]:
a3 = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [46]:
a3

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [48]:
df2['debt'] = a3

df2

       Year State  pop  debt
one    2000   NaN  1.5   NaN
two    2001   NaN  1.7  -1.2
three  2002   NaN  3.6   NaN
four   2001   NaN  2.4  -1.5
five   2002   NaN  2.9  -1.7
six    2003   NaN  3.2   NaN

In [49]:
df2.columns

Index(['Year', 'State', 'pop', 'debt'], dtype='object')

In [55]:
pop_dict = {'Nevada': {2001:2.4,2002:2.9},
           'Ohio': {2000: 1.5,2001:1.7,2002:3.6}}

pop_dict

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [56]:
df3 = pd.DataFrame(pop_dict)

df3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [57]:
df3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [59]:
DataFrame(df3, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [60]:
df3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [61]:
df3['Ohio'][:]

2001    1.7
2002    3.6
2000    1.5
Name: Ohio, dtype: float64

In [62]:
df3['Nevada'][:1]

2001    2.4
Name: Nevada, dtype: float64